IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUM1 PIC 9(9).
   01 WS-NUM2 PIC 9(9).
   01 WS-NUM3 PIC 9(9).
   01 WS-NUM4 PIC 9(9).
   01 WS-NUMCOMP PIC 9(9).

 

PROCEDURE DIVISION.
   A000-FIRST-PARA.
   MOVE 130 TO WS-NUM1.
   MOVE WS-NUM1 TO WS-NUM2 WS-NUM3.
   MOVE WS-NUM1(2:3) TO WS-NUM4.
   *> addition
   ADD WS-NUM1 WS-NUM2 TO WS-NUM3.
   ADD WS-NUM3 WS-NUM1 WS-NUM3 TO WS-NUM4
   *> Subtraction
   SUBTRACT WS-NUM1 FROM WS-NUM2
   subtract WS-NUM1 WS-NUM3 from WS-NUM4 
   *> MULTIPLY
   MULTIPLY WS-NUM1 BY WS-NUM3 
   *> DIVIDE
   DIVIDE WS-NUM1 INTO WS-NUM3
   *> COMPUTING
      COMPUTE WS-NUMCOMP= (WS-NUM1 * WS-NUM3) - (WS-NUM1 / WS-NUM3) + WS-NUM4 - 111.

   

   

   DISPLAY "WS-NUM1     : " WS-NUM1
   DISPLAY "WS-NUM2     : " WS-NUM2
   DISPLAY "WS-NUM3     : " WS-NUM3
   DISPLAY "WS-NUM4     : " WS-NUM4
   DISPLAY "WS-NUMCOMP     : " WS-NUMCOMP


STOP RUN.